**Задача**: Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться ~~коллекциями~~, лучше обойтись исключительно массивами.

**Решение**: *Первоначально* создаем произвольный одномерный массив, наполняем его (цифры, слова, символы различной длины). Массив создается через тип данных - "string".

*Второй этап* решения задачи - отобразить массив в консоле через метод *Printarray*. Для этого, используя цикл *for*, выводим массив, состоящий из различных символов, в консоль (*Console.WriteLine* и *PrintArray(array)*.

*Третий этап* - используя метод *ArraystringsThreeCharacters* - образуем новый массив. Путем объявления новых переменных: *newArray* и  *j* (присваивается значение "0") после цикла *for* (перебираем массив) задаем условие, что если длина первого элемента массива меньше или равна трем, то наполняем этим элементом новый массив, далее с помощью переменнной *j* увеличая счетчик "j+1" проходим по всем элементам массива. Если элементы массива подходят под условие - наполняем массив. По итогам прохождения циклов возвращаем результат - новый массив с элементами, состоящими из одного, двух и трех символов.

*Четвертый этап* - повторно дублируем названия методов, имеющие аргументы "array" - *array = ArraystringsThreeCharacters (array)* и *PrintArray(array)*.

**ИТОГ** - из одного массива получаем новый массив, который содержит строки из трех элементов и менее.